In [1]:
import numpy as np
import pandas as pd

### Creating a DataFrame

In [11]:
data = {
    'Name': ['Rupesh','Rohan','Sahil','Ravi'],
    'Age': [23,42,23,35],
    'City': ['Hajipur', 'Patna', 'Noida', 'Sitamarhi'],
    'Salary': [25000, 70000, 62000, 85000]
}
df1=pd.DataFrame(data)
df1

     Name  Age       City  Salary
0  Rupesh   23    Hajipur   25000
1   Rohan   42      Patna   70000
2   Sahil   23      Noida   62000
3    Ravi   35  Sitamarhi   85000

In [12]:
data_list = [
    ['Sonal',28,'Jandaha',62000],
    ['Abhi',38,'Arniya',72000],
    ['Raushan',42,'Salha',63000],
    ['Sonal',58,'Pirapur',92000],
]
columns = ['Name', 'Age', 'City', 'Salary']

In [13]:
df2=pd.DataFrame(data_list, columns=columns)
df2

      Name  Age     City  Salary
0    Sonal   28  Jandaha   62000
1     Abhi   38   Arniya   72000
2  Raushan   42    Salha   63000
3    Sonal   58  Pirapur   92000

### Selection and Indexing of column

In [14]:
df2['Name']

0      Sonal
1       Abhi
2    Raushan
3      Sonal
Name: Name, dtype: str

In [16]:
df2['City']

0    Jandaha
1     Arniya
2      Salha
3    Pirapur
Name: City, dtype: str

In [17]:
df1[['Name','City']]

     Name       City
0  Rupesh    Hajipur
1   Rohan      Patna
2   Sahil      Noida
3    Ravi  Sitamarhi

### Creating a new column

In [18]:
df2['Designation']= ["Doctor","Eng","Doctor","Eng"]

In [19]:
df2

      Name  Age     City  Salary Designation
0    Sonal   28  Jandaha   62000      Doctor
1     Abhi   38   Arniya   72000         Eng
2  Raushan   42    Salha   63000      Doctor
3    Sonal   58  Pirapur   92000         Eng

### Removing Column

### Selecting Rows

### Selecting Subsets of rows and columns

### Conditional Selection